[
{"text":"Python is named after Monty Python, not the snake."},
{"text":"The first website went live in 1991."},
{"text":"The first computer virus was created in 1986."},
{"text":"The first programmer was Ada Lovelace."},
{"text":"The first computer bug was an actual moth stuck in a machine."},
{"text":"JavaScript was created in 10 days."},
{"text":"The first hard disk could hold 5MB of data."},
{"text":"The first email was sent in 1971."},
{"text":"The first computer mouse was made of wood."},
{"text":"Linux was created by Linus Torvalds in 1991."},
{"text":"Google was originally called Backrub."},
{"text":"The first webcam monitored a coffee pot."},
{"text":"The original name for Windows was Interface Manager."},
{"text":"The first video game was created in 1958."},
{"text":"HTML stands for HyperText Markup Language."},
{"text":"CSS stands for Cascading Style Sheets."},
{"text":"Python is one of the top 3 programming languages in 2025."},
{"text":"The first Apple computer was built in a garage."},
{"text":"The first smartphone was IBM Simon, released in 1994."},
{"text":"The first domain name ever registered was symbolics.com."},
{"text":"Google's first storage was made of LEGO bricks."},
{"text":"The first computer virus for Windows was called 'WinVir'."},
{"text":"The first computer game character was a pixelated dot."},
{"text":"C++ was created by Bjarne Stroustrup."},
{"text":"The first programming language was Fortran."},
{"text":"The first webcam image was of a coffee pot at Cambridge."},
{"text":"The first Apple logo featured Isaac Newton."},
{"text":"The first web browser was called WorldWideWeb."},
{"text":"The first 'emoji' was created in 1999 by Shigetaka Kurita."},
{"text":"The first YouTube video was uploaded in 2005."},
{"text":"The first tweet was sent by Jack Dorsey in 2006."},
{"text":"The first virus spread via floppy disks."},
{"text":"The first operating system was GM-NAA I/O."},
{"text":"The first text message was sent in 1992."},
{"text":"The first cloud service was launched in 2006."},
{"text":"The first computer language compiler was created in 1952."},
{"text":"The first microprocessor was Intel 4004."},
{"text":"The first graphical user interface was developed at Xerox PARC."},
{"text":"The first web server was CERN httpd."},
{"text":"The first email spam was sent in 1978."},
{"text":"The first smartphone had a touchscreen."},
{"text":"The first Wi-Fi protocol was 802.11b."},
{"text":"The first computer to beat a human in chess was Deep Blue."},
{"text":"The first game console was Magnavox Odyssey."},
{"text":"The first video uploaded online was 'Me at the zoo'."},
{"text":"The first digital camera was made in 1975."},
{"text":"The first IBM PC used MS-DOS."},
{"text":"The first computer virus in the wild was Brain."},
{"text":"The first emoji set had 176 icons."},
{"text":"The first Apple iPhone was released in 2007."}
]
